FoamProject/Flat_plate_icoFoam/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.0 0.0 0.0);

boundaryField
{
    wall_top
    {
	type            noSlip;
    }

    inlet
    {
	type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
        
    }
    wall_base
    {
        type            noSlip;
    }

    plate_top
    {
        type            noSlip;
    }
    
    plate_base
    {
        type            noSlip;
    }
    
    plate_leading
    {
        type            noSlip;
    }
    
    plate_trailing
    {
        type            noSlip;
    }

    back
    {
        type            empty;
    }
    
    front
    {
        type            empty;
    }
}



// ************************************************************************* //
