FoamProject/Flat_plate_icoFoam/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    wall_top
    {
        type            zeroGradient;
    }

    inlet
    {
	type            fixedValue;
	value		uniform 1.0;
    }
    outlet
    {
	type            zeroGradient;
    }
    wall_base
    {
        type            zeroGradient;
    }
    
    plate_top
    {
        type            zeroGradient;
    }
    
    plate_base
    {
        type            zeroGradient;
    }
    
    plate_leading
    {
        type            zeroGradient;
    }
    
    plate_trailing
    {
        type            zeroGradient;
    }

    back
    {
        type            empty;
    }
    
    front
    {
        type            empty;
    }
}

// ************************************************************************* //
